from objects import StackOfContainers
from logic import sort_containers
from logic import clear_console
from logic import print_exception

print(
fr"""
 ＿＿＿
//￣￣＼＼                  ／＞　　 フ Z
\\      \\      ＿＿＿＿＿＿| 　n　 n l z  
 ＼＼   //   ／            ヽ` ミ＿ωノ ~  (Спасибо что используйте container sort!)
   \/  \\ /             )       /       
       \\　 ／＿_  ヽ     __ __／
        ￣ヽ＿______) ＿＿___)__)
"""
)
close = False
while not close:
    try:
        options = int(input("================================================================\n"
                            "| Меню программы container sort. Пожалуйста, выберете опцию!   |\n"
                            "================================================================\n"
                            "1) Отсортировать контейнеры\n"
                            "2) Выйти из программы\n"
                            "Ваш выбор: "))
        if not 1 <= options <= 2:
            raise ValueError
    except ValueError:
        print_exception("================================================================\n"
                        "| Неверная опция, перезапуск программы                         |\n"
                        "================================================================\n")
        continue
    clear_console()
    if options == 2:
        close = True
    elif options == 1:
        try:
            N = int(input("================================================================\n"
                          "| Сортировка контейнеров. Пожалуйста, введите необходимую      |\n"
                          "| информацию, в соответствии с шаблоном.                       |\n"
                          "================================================================\n"
                          "> Введите количество стопок: "))
            if N <= 0:
                raise ValueError

        except ValueError:
            print_exception("================================================================\n"
                            "| Количество стопок должно соответствовать натуральному числу, |\n"
                            "| перезапуск программы.                                        |\n"
                            "================================================================\n")
            continue
        stacks = []
        print("================================================================\n"
              "| Введите контейнеры в соответствии с шаблоном.                |\n"              
              "| Обратите внимание, что введённые контейнеры будут            |\n"
              "| расположены в порядке 'снизу-вверх'.                         |\n"
              "| K - количество контейнеров в стопке,                         |\n"
              "| a b c ... z - контейнеры определённого типа.                 |\n"
              "| Если вы хотите оставить стопку пустой, введите 0.            |\n"
              "| Шаблон: K a b c ... z, Пример: 4 1 2 3 4                     |\n"
              "================================================================")

        all_containers = []
        wrong_input = False
        for i in range(N):
            stack = StackOfContainers()
            input_list = str(input(f"> Введите стопку под номером {i+1}: ")).split(" ")
            if any((not char.isdigit() and char != "") for char in input_list):
                print_exception("================================================================\n"
                                "| Ошибка ввода, перезапуск программы                           |\n"
                                "================================================================\n")
                wrong_input = True
                break

            if input_list[0] == "":
                input_list = []
            containers_amount = int(input_list.pop(0) if input_list else 0)
            if containers_amount != len(input_list):
                print_exception("================================================================\n"
                                "| Количество контейнеров указано неверно, перезапуск программы |\n"
                                "================================================================\n")
                wrong_input = True
                break

            stack.add_list(input_list)
            all_containers.extend(input_list)
            print(f"> Ваша стопка {i+1}: {str(stack)}")
            stacks.append(stack)
        if wrong_input:
            continue
        types = list(set(all_containers))
        if len(stacks) < len(types):
            #print_exception("================================================================\n"
            #                "| Контейнеры невозможно отсортировать, перезапуск программы    |\n"
            #                "================================================================\n")
            print_exception("0")
            continue
        sort_containers(stacks, types)



